# **Pandas 19 - Formatting tampilan Data Frame**

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

   omset  operasional
0     12           19
1     14            7
2      9           12
3     13            7
4     16           19

In [4]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1200000       190000
1  1400000        70000
2   900000       120000
3  1300000        70000
4  1600000       190000

In [5]:
# Menambahkan kolom 'tanggal'
start_date = pd.to_datetime('2000-01-01')
df['tanggal'] = pd.date_range(start=start_date, periods=n_rows)

# Reorder columns to match the desired order
df = df[['tanggal', 'omset', 'operasional']]

# Display the DataFrame
df

     tanggal    omset  operasional
0 2000-01-01  1200000       190000
1 2000-01-02  1400000        70000
2 2000-01-03   900000       120000
3 2000-01-04  1300000        70000
4 2000-01-05  1600000       190000

### Melakukan formatting tampilan Data Frame

In [6]:
# Format yang akan digunakan untuk menampilkan DataFrame
formatku = {'tanggal': '{:%d/%m/%y}', 'operasional': 'Rp {:.2f}', 'omset': 'Rp {:.2f}'}

# Membuat objek Styler untuk DataFrame dengan format yang ditentukan
laporan = df.style.format(formatku)

# Menampilkan objek Styler, bukan objek DataFrame
laporan

In [7]:
# Menampilkan tipe data dari objek Styler
type(laporan)

pandas.io.formats.style.Styler

In [8]:
# Membuat salinan DataFrame dan mengganti indeksnya dengan string kosong
df_temp = df.copy()
df_temp.index = [''] * len(df)

# Membuat objek Styler dengan format yang telah ditentukan
df_temp_styled = df_temp.style.format(formatku)

# Menampilkan tampilan yang diformat menggunakan Styler
df_temp_styled

In [9]:
# Menambahkan judul/caption ke Styler
laporan.set_caption('Data Omset dan Operasional')

# Memberikan caption atau judul pada tampilan Styler untuk memberikan konteks atau informasi tambahan.

In [10]:
# Menyoroti nilai minimum dan maksimum pada kolom 'omset' dengan warna berbeda
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

# Menyoroti nilai minimum dan maksimum pada kolom 'operasional' dengan warna berbeda
laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

# Menyajikan tampilan yang diberi sorotan untuk memvisualisasikan nilai minimum dan maksimum pada data omset dan operasional.